{
    "char-ktn": "언니인 나가세 마나의 뜻을 이어받아 아이돌이 된 소녀. 그룹 초기에는 타인과의 커뮤니케이션을 피해서 홀로 활동하는 일이 잦았다. 하지만 멤버들과 고난을 헤쳐나가며 성장했고, 지금은 멤버들을 이끄는 존재가 되었다.",
    "char-ngs": "절친 코토노의 힘이 되어주기 위해 아이돌이 된 소녀. 상상력이 풍부하고 특이한 부분에 호기심을 보인다. 아이돌로서 뚜렷한 장점이 없어서 자신감을 잃을 때도 있지만, 코토노를 생각하는 마음 하나로 매일 최선을 다하고 있다.",
    "char-ski": "학생회장을 맡고 있는 전형적인 우등생이자 달의 템페스트의 구심점. 데뷔 초기에는 동생 치사를 과보호하는 것이 아닌가 하는 고민도 있었지만 지금은 서로를 신뢰하며 각자의 길을 걷고 있다.",
    "char-suz": "마나의 열정적인 팬이자 장난치고 싶게 만드는 덜렁이 아가씨. 부모님이 강제로 유학을 보내려 해서 반쯤 도망치듯 소속사를 찾아왔다. 이후 본인의 회피성 성격을 극복하고 부모님께도 정식으로 인정받아 호시미 프로덕션에서 활약하고 있다.",
    "char-mei": "직감에 의존하여 살아가는 예측 불가능한 매력을 가진 순수한 소녀.\"재밌겠다\"는 단순한 동기로 아이돌이 되기 위해 소속사를 찾아왔다. 하지만, 마나가 가진 아이돌로서의 마음가짐에 깊은 감명을 받은 뒤에, 진심으로 그녀와 같은 아이돌이 되기 위해서 노력하고 있다.",
    "char-skr": "일상을 소중히 여기는 천진난만한 아이돌. 마나와 똑같은 목소리로 노래를 불러서 이목을 끌었지만, 점점 마나의 목소리로 무대에 서는 것에 대해 고민하기 시작한다. 마침내 고뇌를 뛰어넘어, 마나의 목소리와 이별을 택한 뒤에 미래로 나아가기로 결심한다.",
    "char-szk": "좀처럼 웃지 않는 과묵한 아이돌 오타쿠. 처음에는 토크 실력이나 빈약한 감정 표현 때문에 아이돌로서의 자신감을 잃었다. 하지만 같은 고민을 안고 있던 치사와 의기투합하여 서로 지지하며 매일 성장하고 있다.",
    "char-chs": "소극적이고 겁이 많은 성격. 그런 자신을 바꾸기 위해 아이돌을 지망했다. 처음에는 언니의 뒤만 따라다녔지만, 아이돌로서 활동하면서 서서히 자신감이 생겼고, 언니와 동등한 입장에서 스스로 나아가겠다고 결심한다.",
    "char-rei": "댄스 대회에서 우승할 정도로 뛰어난 실력자. 댄스를 직업으로 삼는 것을 부모님께 인정받기 위해 아이돌을 지망했다. 들어온 지 얼마 안 됐을 때에는 멤버들에게 강도 높은 연습을 요구해서 갈등을 빚기도 했지만, 뛰어난 춤 실력으로 모두를 이끌어가는 방법을 찾아냈다.",
    "char-hrk": "큰언니이자 서니 피스의 구심점. 현역 시절 마나를 알고 있으며, 최초로 호시미 프로덕션에 소속된 아이돌이다. 한때 꿈을 포기하려 했지만, 믿어주는 사람들을 배신할 수 없어 다시 각오를 다지고 아이돌 활동에 힘쓰고 있다.",
    "char-rui": "트리니티엘의 카리스마 센터. 천재라고 불리고 있지만, 무대 뒤에서 끊임없이 노력하고 있다. 완전무결하고 당당한 태도를 보이지만, 갑자기 잠이 들거나 편식을 하는 모습도 있다.",
    "char-yu": "교토에서 태어났으며 항상 침착한 트리니티엘의 구심점. 대기업 사장인 아버지와 유명 여배우인 어머니 사이에서 태어났다. 루이에게 이끌려 루이를 제일 먼저 생각하고 행동한다. 이 사실은 팬들도 잘 알고 있기 때문에 이러한 유우의 헌신적인 태도에 매력을 느낀 팬들도 많다.",
    "char-smr": "가족을 생각하여 아이돌을 지망한 천재 아역 출신. 중학생으로 보이지 않을 정도로 똑 부러진 성격의 소유자로 한 번 만난 사람의 얼굴과 이름을 정확하게 기억하는 특기가 있다. 하지만, 마음을 터놓을 수 있는 친구에게는 나이에 맞는 천진난만함을 보여주기도 한다.",
    "char-rio": "승리 욕심이 많은 영원한 리즈누아르의 센터. 그랑프리 결승 상대였던 마나가 죽은 이후, 목표를 잃어버렸다는 상실감 때문에 어쩔 수 없이 활동을 쉬었던 적이 있다. 멤버를 추가로 영입한 이후에는 심경의 변화를 보이며 성장하고 있다.",
    "char-aoi": "감정 기복이 적고, 항상 침착한 리즈누아르의 브레인. 리오와 신뢰관계가 투텁기 때문에 강제로 활동을 쉬게 되었을 때에도 새로운 멤버 영입을 거절하고 리오를 기다렸다. 한 번 본 댄스는 바로 따라 할 수 있는 실력자이다.",
    "char-ai": "사람들을 미소 짓게 만드는 걸 좋아하는 리즈누아르의 분위기 메이커. 연습생 시절부터 코코로와 친구였기 때문에 자주 놀림받는다. 실력은 확실하지만, 중요할 때 덜렁대서 리오에게 자주 혼난다.",
    "char-kkr": "붙임성이 좋지만 덜렁거리는 리즈누아르의 돌격대장. 코미야마 아이와는 서로를 인정하는 사이지만, 서로 이상한 것까지 닮아가고 있다. 지금까지 리즈누아르에는 없었던 애교와 사랑스러움을 무기로, 리주누아르에 새로운 활력을 불어넣고 있다.",
    "char-mna": "'별이 만든 기적'이라 불렸던 전설의 아이돌. 데뷔 1년 6개월 만에 세상을 떠났다. 하지만, 짧은 활동 기간 동안에 수많은 전설과 기록을 남겼고, 세상을 떠난 후에도 많은 아이돌에게 영향을 미치고 있다.",
    "char-kor": "뛰어난 스타일을 지닌 타고난 천재로 노력 따위는 모르는 카리스마. ⅢX 센터. 파리 컬렉션 경험도 있는 탑 모델 출신. 어떤 이유로 극단적으로 돈에 집착하고 있다.",
    "char-kan": "겉과 속이 다르지만, 매우 뛰어난 센스를 가진 소악마 아이돌. 인기 모델 출신으로 어릴 때부터 수많은 잡지 표지 모델을 하고 있다. 승인 욕구가 높아 SNS 팔로워는 200만 이상.",
    "char-mhk": "풍부한 경험과 지식을 강점으로 활동에 힘쓰는 이론파. BIG4에 손이 닿기 직전에 갑자기 해체된 인기 2인조 아이돌 멤버였던 과거를 가짐. 그룹의 두뇌 담당. 기본적으로 온후하지만 집념 강한 일면도 있음.",
    "char-mku": "세대를 초월하여 사랑받는 발랄하고 귀여운 버추얼 싱어. VENUS 프로그램과는 무관한 무대에서 활약하고 있으며, 그 밝고 아름다운 노랫소리는 전 세계 사람들을 매료시키고 있다."
}